import React from 'react';


export default function () {

  return (
      <svg className="icon" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 30 30" aria-labelledby="title"><defs/>
        <title id="title">Добавить точку в маршрут</title>
        <path className="icon__path" fill="#E9E9E9" d="M13.893 8.555v5.274H8.619a1.172 1.172 0 100 2.344h5.274v5.33a1.172 1.172 0 102.343 0v-5.33h5.274a1.172 1.172 0 100-2.344h-5.274V8.555a1.172 1.172 0 10-2.343 0zm14.935.879c.647 0 1.172.524 1.172 1.171v14.707A4.693 4.693 0 0125.312 30H4.688A4.693 4.693 0 010 25.312V4.688A4.693 4.693 0 014.688 0h20.625A4.693 4.693 0 0130 4.688a1.172 1.172 0 11-2.344 0 2.346 2.346 0 00-2.343-2.344H4.688a2.346 2.346 0 00-2.344 2.344v20.625a2.346 2.346 0 002.344 2.343h20.625a2.346 2.346 0 002.343-2.343V10.605c0-.648.525-1.172 1.172-1.172z"/>
      </svg>
  )
}
